Dlubal.RFEM5.SolidLoad
Solid load parameters.

Dlubal.RFEM5.SolidLoad.No
Number

Dlubal.RFEM5.SolidLoad.ID
Identifier

Dlubal.RFEM5.SolidLoad.Comment
Comment

Dlubal.RFEM5.SolidLoad.Tag
Tag

Dlubal.RFEM5.SolidLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.SolidLoad.SolidList
List of solids on which is the load defined.

Dlubal.RFEM5.SolidLoad.Type
Type of solid load

Dlubal.RFEM5.SolidLoad.Distribution
Distribution of solid load

Dlubal.RFEM5.SolidLoad.Direction
Direction of solid load

Dlubal.RFEM5.SolidLoad.Node1No
Load at the first node

Dlubal.RFEM5.SolidLoad.Magnitude1
Load magnitude at the first node.

Dlubal.RFEM5.SolidLoad.Node2No
Load at the second node

Dlubal.RFEM5.SolidLoad.Magnitude2
Load magnitude at the second node.

Dlubal.RFEM5.SolidLoad.RotaryMotionAxis
Axis of rotary motion

Dlubal.RFEM5.SolidLoad.Buoyancy
Buoyancy parameters